docs/stress-test/results/k6/stage5-k6-full-flow-session-50vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/rme-full-flow-50-users.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * full_flow_users: 50 looping VUs for 3m0s (exec: fullFlow, gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   1% ] 50 VUs  0m01.0s/3m0s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   1% ] 50 VUs  0m02.0s/3m0s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   2% ] 50 VUs  0m03.0s/3m0s

running (0m04.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   2% ] 50 VUs  0m04.0s/3m0s

running (0m05.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   3% ] 50 VUs  0m05.0s/3m0s

running (0m06.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   3% ] 50 VUs  0m06.0s/3m0s

running (0m07.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   4% ] 50 VUs  0m07.0s/3m0s

running (0m08.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   4% ] 50 VUs  0m08.0s/3m0s

running (0m09.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   5% ] 50 VUs  0m09.0s/3m0s

running (0m10.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   6% ] 50 VUs  0m10.0s/3m0s

running (0m11.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   6% ] 50 VUs  0m11.0s/3m0s

running (0m12.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   7% ] 50 VUs  0m12.0s/3m0s

running (0m13.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   7% ] 50 VUs  0m13.0s/3m0s

running (0m14.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   8% ] 50 VUs  0m14.0s/3m0s

running (0m15.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   8% ] 50 VUs  0m15.0s/3m0s

running (0m16.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   9% ] 50 VUs  0m16.0s/3m0s

running (0m17.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [   9% ] 50 VUs  0m17.0s/3m0s

running (0m18.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  10% ] 50 VUs  0m18.0s/3m0s

running (0m19.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  11% ] 50 VUs  0m19.0s/3m0s

running (0m20.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  11% ] 50 VUs  0m20.0s/3m0s

running (0m21.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  12% ] 50 VUs  0m21.0s/3m0s

running (0m22.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  12% ] 50 VUs  0m22.0s/3m0s

running (0m23.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  13% ] 50 VUs  0m23.0s/3m0s

running (0m24.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  13% ] 50 VUs  0m24.0s/3m0s

running (0m25.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
full_flow_users   [  14% ] 50 VUs  0m25.0s/3m0s

running (0m26.0s), 50/50 VUs, 23 complete and 0 interrupted iterations
full_flow_users   [  14% ] 50 VUs  0m26.0s/3m0s

running (0m27.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  15% ] 50 VUs  0m27.0s/3m0s

running (0m28.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  16% ] 50 VUs  0m28.0s/3m0s

running (0m29.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  16% ] 50 VUs  0m29.0s/3m0s

running (0m30.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  17% ] 50 VUs  0m30.0s/3m0s

running (0m31.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  17% ] 50 VUs  0m31.0s/3m0s

running (0m32.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  18% ] 50 VUs  0m32.0s/3m0s

running (0m33.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  18% ] 50 VUs  0m33.0s/3m0s

running (0m34.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  19% ] 50 VUs  0m34.0s/3m0s

running (0m35.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  19% ] 50 VUs  0m35.0s/3m0s

running (0m36.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  20% ] 50 VUs  0m36.0s/3m0s

running (0m37.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  21% ] 50 VUs  0m37.0s/3m0s

running (0m38.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  21% ] 50 VUs  0m38.0s/3m0s

running (0m39.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  22% ] 50 VUs  0m39.0s/3m0s

running (0m40.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  22% ] 50 VUs  0m40.0s/3m0s

running (0m41.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
full_flow_users   [  23% ] 50 VUs  0m41.0s/3m0s

running (0m42.0s), 50/50 VUs, 55 complete and 0 interrupted iterations
full_flow_users   [  23% ] 50 VUs  0m42.0s/3m0s

running (0m43.0s), 50/50 VUs, 86 complete and 0 interrupted iterations
full_flow_users   [  24% ] 50 VUs  0m43.0s/3m0s

running (0m44.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  24% ] 50 VUs  0m44.0s/3m0s

running (0m45.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  25% ] 50 VUs  0m45.0s/3m0s

running (0m46.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  26% ] 50 VUs  0m46.0s/3m0s

running (0m47.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  26% ] 50 VUs  0m47.0s/3m0s

running (0m48.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  27% ] 50 VUs  0m48.0s/3m0s

running (0m49.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  27% ] 50 VUs  0m49.0s/3m0s

running (0m50.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  28% ] 50 VUs  0m50.0s/3m0s

running (0m51.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  28% ] 50 VUs  0m51.0s/3m0s

running (0m52.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  29% ] 50 VUs  0m52.0s/3m0s

running (0m53.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  29% ] 50 VUs  0m53.0s/3m0s

running (0m54.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  30% ] 50 VUs  0m54.0s/3m0s

running (0m55.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  31% ] 50 VUs  0m55.0s/3m0s

running (0m56.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  31% ] 50 VUs  0m56.0s/3m0s

running (0m57.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  32% ] 50 VUs  0m57.0s/3m0s

running (0m58.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
full_flow_users   [  32% ] 50 VUs  0m58.0s/3m0s

running (0m59.0s), 50/50 VUs, 118 complete and 0 interrupted iterations
full_flow_users   [  33% ] 50 VUs  0m59.0s/3m0s

running (1m00.0s), 50/50 VUs, 145 complete and 0 interrupted iterations
full_flow_users   [  33% ] 50 VUs  1m00.0s/3m0s

running (1m01.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  34% ] 50 VUs  1m01.0s/3m0s

running (1m02.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  34% ] 50 VUs  1m02.0s/3m0s

running (1m03.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  35% ] 50 VUs  1m03.0s/3m0s

running (1m04.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  36% ] 50 VUs  1m04.0s/3m0s

running (1m05.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  36% ] 50 VUs  1m05.0s/3m0s

running (1m06.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  37% ] 50 VUs  1m06.0s/3m0s

running (1m07.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  37% ] 50 VUs  1m07.0s/3m0s

running (1m08.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  38% ] 50 VUs  1m08.0s/3m0s

running (1m09.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  38% ] 50 VUs  1m09.0s/3m0s

running (1m10.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  39% ] 50 VUs  1m10.0s/3m0s

running (1m11.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  39% ] 50 VUs  1m11.0s/3m0s

running (1m12.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  40% ] 50 VUs  1m12.0s/3m0s

running (1m13.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  41% ] 50 VUs  1m13.0s/3m0s

running (1m14.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  41% ] 50 VUs  1m14.0s/3m0s

running (1m15.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
full_flow_users   [  42% ] 50 VUs  1m15.0s/3m0s

running (1m16.0s), 50/50 VUs, 178 complete and 0 interrupted iterations
full_flow_users   [  42% ] 50 VUs  1m16.0s/3m0s

running (1m17.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  43% ] 50 VUs  1m17.0s/3m0s

running (1m18.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  43% ] 50 VUs  1m18.0s/3m0s

running (1m19.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  44% ] 50 VUs  1m19.0s/3m0s

running (1m20.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  44% ] 50 VUs  1m20.0s/3m0s

running (1m21.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  45% ] 50 VUs  1m21.0s/3m0s

running (1m22.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  46% ] 50 VUs  1m22.0s/3m0s

running (1m23.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  46% ] 50 VUs  1m23.0s/3m0s

running (1m24.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  47% ] 50 VUs  1m24.0s/3m0s

running (1m25.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  47% ] 50 VUs  1m25.0s/3m0s

running (1m26.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  48% ] 50 VUs  1m26.0s/3m0s

running (1m27.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  48% ] 50 VUs  1m27.0s/3m0s

running (1m28.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  49% ] 50 VUs  1m28.0s/3m0s

running (1m29.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  49% ] 50 VUs  1m29.0s/3m0s

running (1m30.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  50% ] 50 VUs  1m30.0s/3m0s

running (1m31.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
full_flow_users   [  51% ] 50 VUs  1m31.0s/3m0s

running (1m32.0s), 50/50 VUs, 211 complete and 0 interrupted iterations
full_flow_users   [  51% ] 50 VUs  1m32.0s/3m0s

running (1m33.0s), 50/50 VUs, 239 complete and 0 interrupted iterations
full_flow_users   [  52% ] 50 VUs  1m33.0s/3m0s

running (1m34.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  52% ] 50 VUs  1m34.0s/3m0s

running (1m35.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  53% ] 50 VUs  1m35.0s/3m0s

running (1m36.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  53% ] 50 VUs  1m36.0s/3m0s

running (1m37.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  54% ] 50 VUs  1m37.0s/3m0s

running (1m38.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  54% ] 50 VUs  1m38.0s/3m0s

running (1m39.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  55% ] 50 VUs  1m39.0s/3m0s

running (1m40.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  56% ] 50 VUs  1m40.0s/3m0s

running (1m41.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  56% ] 50 VUs  1m41.0s/3m0s

running (1m42.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  57% ] 50 VUs  1m42.0s/3m0s

running (1m43.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  57% ] 50 VUs  1m43.0s/3m0s

running (1m44.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  58% ] 50 VUs  1m44.0s/3m0s

running (1m45.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  58% ] 50 VUs  1m45.0s/3m0s

running (1m46.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  59% ] 50 VUs  1m46.0s/3m0s

running (1m47.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  59% ] 50 VUs  1m47.0s/3m0s

running (1m48.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
full_flow_users   [  60% ] 50 VUs  1m48.0s/3m0s

running (1m49.0s), 50/50 VUs, 266 complete and 0 interrupted iterations
full_flow_users   [  61% ] 50 VUs  1m49.0s/3m0s

running (1m50.0s), 50/50 VUs, 293 complete and 0 interrupted iterations
full_flow_users   [  61% ] 50 VUs  1m50.0s/3m0s

running (1m51.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  62% ] 50 VUs  1m51.0s/3m0s

running (1m52.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  62% ] 50 VUs  1m52.0s/3m0s

running (1m53.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  63% ] 50 VUs  1m53.0s/3m0s

running (1m54.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  63% ] 50 VUs  1m54.0s/3m0s

running (1m55.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  64% ] 50 VUs  1m55.0s/3m0s

running (1m56.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  64% ] 50 VUs  1m56.0s/3m0s

running (1m57.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  65% ] 50 VUs  1m57.0s/3m0s

running (1m58.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  66% ] 50 VUs  1m58.0s/3m0s

running (1m59.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  66% ] 50 VUs  1m59.0s/3m0s

running (2m00.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  67% ] 50 VUs  2m00.0s/3m0s

running (2m01.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  67% ] 50 VUs  2m01.0s/3m0s

running (2m02.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  68% ] 50 VUs  2m02.0s/3m0s

running (2m03.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  68% ] 50 VUs  2m03.0s/3m0s

running (2m04.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  69% ] 50 VUs  2m04.0s/3m0s

running (2m05.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
full_flow_users   [  69% ] 50 VUs  2m05.0s/3m0s

running (2m06.0s), 50/50 VUs, 327 complete and 0 interrupted iterations
full_flow_users   [  70% ] 50 VUs  2m06.0s/3m0s

running (2m07.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  71% ] 50 VUs  2m07.0s/3m0s

running (2m08.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  71% ] 50 VUs  2m08.0s/3m0s

running (2m09.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  72% ] 50 VUs  2m09.0s/3m0s

running (2m10.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  72% ] 50 VUs  2m10.0s/3m0s

running (2m11.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  73% ] 50 VUs  2m11.0s/3m0s

running (2m12.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  73% ] 50 VUs  2m12.0s/3m0s

running (2m13.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  74% ] 50 VUs  2m13.0s/3m0s

running (2m14.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  74% ] 50 VUs  2m14.0s/3m0s

running (2m15.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  75% ] 50 VUs  2m15.0s/3m0s

running (2m16.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  76% ] 50 VUs  2m16.0s/3m0s

running (2m17.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  76% ] 50 VUs  2m17.0s/3m0s

running (2m18.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  77% ] 50 VUs  2m18.0s/3m0s

running (2m19.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  77% ] 50 VUs  2m19.0s/3m0s

running (2m20.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  78% ] 50 VUs  2m20.0s/3m0s

running (2m21.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
full_flow_users   [  78% ] 50 VUs  2m21.0s/3m0s

running (2m22.0s), 50/50 VUs, 361 complete and 0 interrupted iterations
full_flow_users   [  79% ] 50 VUs  2m22.0s/3m0s

running (2m23.0s), 50/50 VUs, 387 complete and 0 interrupted iterations
full_flow_users   [  79% ] 50 VUs  2m23.0s/3m0s

running (2m24.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  80% ] 50 VUs  2m24.0s/3m0s

running (2m25.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  81% ] 50 VUs  2m25.0s/3m0s

running (2m26.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  81% ] 50 VUs  2m26.0s/3m0s

running (2m27.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  82% ] 50 VUs  2m27.0s/3m0s

running (2m28.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  82% ] 50 VUs  2m28.0s/3m0s

running (2m29.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  83% ] 50 VUs  2m29.0s/3m0s

running (2m30.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  83% ] 50 VUs  2m30.0s/3m0s

running (2m31.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  84% ] 50 VUs  2m31.0s/3m0s

running (2m32.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  84% ] 50 VUs  2m32.0s/3m0s

running (2m33.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  85% ] 50 VUs  2m33.0s/3m0s

running (2m34.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  86% ] 50 VUs  2m34.0s/3m0s

running (2m35.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  86% ] 50 VUs  2m35.0s/3m0s

running (2m36.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  87% ] 50 VUs  2m36.0s/3m0s

running (2m37.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  87% ] 50 VUs  2m37.0s/3m0s

running (2m38.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
full_flow_users   [  88% ] 50 VUs  2m38.0s/3m0s

running (2m39.0s), 50/50 VUs, 418 complete and 0 interrupted iterations
full_flow_users   [  88% ] 50 VUs  2m39.0s/3m0s

running (2m40.0s), 50/50 VUs, 446 complete and 0 interrupted iterations
full_flow_users   [  89% ] 50 VUs  2m40.0s/3m0s

running (2m41.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  89% ] 50 VUs  2m41.0s/3m0s

running (2m42.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  90% ] 50 VUs  2m42.0s/3m0s

running (2m43.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  91% ] 50 VUs  2m43.0s/3m0s

running (2m44.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  91% ] 50 VUs  2m44.0s/3m0s

running (2m45.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  92% ] 50 VUs  2m45.0s/3m0s

running (2m46.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  92% ] 50 VUs  2m46.0s/3m0s

running (2m47.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  93% ] 50 VUs  2m47.0s/3m0s

running (2m48.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  93% ] 50 VUs  2m48.0s/3m0s

running (2m49.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  94% ] 50 VUs  2m49.0s/3m0s

running (2m50.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  94% ] 50 VUs  2m50.0s/3m0s

running (2m51.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  95% ] 50 VUs  2m51.0s/3m0s

running (2m52.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  96% ] 50 VUs  2m52.0s/3m0s

running (2m53.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  96% ] 50 VUs  2m53.0s/3m0s

running (2m54.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
full_flow_users   [  97% ] 50 VUs  2m54.0s/3m0s

running (2m55.0s), 50/50 VUs, 452 complete and 0 interrupted iterations
full_flow_users   [  97% ] 50 VUs  2m55.0s/3m0s

running (2m56.0s), 50/50 VUs, 479 complete and 0 interrupted iterations
full_flow_users   [  98% ] 50 VUs  2m56.0s/3m0s

running (2m57.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users   [  98% ] 50 VUs  2m57.0s/3m0s

running (2m58.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users   [  99% ] 50 VUs  2m58.0s/3m0s

running (2m59.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users   [  99% ] 50 VUs  2m59.0s/3m0s

running (3m00.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users   [ 100% ] 50 VUs  3m00.0s/3m0s

running (3m01.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m02.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m03.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m04.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m05.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m06.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m07.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m08.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m09.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m10.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m12.0s), 38/50 VUs, 512 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s

running (3m13.0s), 02/50 VUs, 548 complete and 0 interrupted iterations
full_flow_users ↓ [ 100% ] 50 VUs  3m0s


  █ THRESHOLDS 

    full_flow_duration
    ✗ 'p(95)<15000' p(95)=25962.25

    full_flow_success_rate
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=915.17ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5150    26.680609/s
    checks_succeeded...: 100.00% 5150 out of 5150
    checks_failed......: 0.00%   0 out of 5150

    ✓ login_page HTTP 200
    ✓ login accepted
    ✓ context accepted
    ✓ dashboard_auth_check HTTP 200
    ✓ rme_dashboard HTTP 200
    ✓ rme_visits HTTP 200
    ✓ rme_visit_show HTTP 200
    ✓ rme_medical_record HTTP 200
    ✓ rme_odontogram HTTP 200
    ✓ rme_cashier HTTP 200
    ✓ rme_receivables HTTP 200
    ✓ rme_reports_patients HTTP 200
    ✓ rme_reports_payments HTTP 200

    CUSTOM
    full_flow_duration.............: avg=17491.709091 min=16273   med=16638    max=26915  p(90)=16850.1  p(95)=25962.25
    full_flow_success_rate.........: 100.00% 550 out of 550

    HTTP
    http_req_duration..............: avg=833.36ms     min=25.35ms med=825.09ms max=1.96s  p(90)=867.75ms p(95)=915.17ms
      { expected_response:true }...: avg=833.36ms     min=25.35ms med=825.09ms max=1.96s  p(90)=867.75ms p(95)=915.17ms
    http_req_failed................: 0.00%   0 out of 10350
    http_reqs......................: 10350   53.620253/s

    EXECUTION
    iteration_duration.............: avg=17.49s       min=16.27s  med=16.63s   max=26.91s p(90)=16.85s   p(95)=25.96s  
    iterations.....................: 550     2.849385/s
    vus............................: 2       min=2          max=50
    vus_max........................: 50      min=50         max=50

    NETWORK
    data_received..................: 32 MB   168 kB/s
    data_sent......................: 8.3 MB  43 kB/s



running (3m13.0s), 00/50 VUs, 550 complete and 0 interrupted iterations
full_flow_users ✓ [ 100% ] 50 VUs  3m0s